Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/the_president/presidential_commission.html.txt.tmx
Source language: en
Languages: ga

source: If the President of Ireland is absent, becomes incapacitated, dies, resigns, is removed from office or fails to perform their functions, the Presidential Commission steps in to perform the functions of the President
ga: Má bhíonn an tUachtarán as láthair, má bhíonn siad ar míthreoir, má chailltear iad, má éiríonn iad as oifig nó má chuirtear as oifig iad nó má theipeann orthu a feidhmeanna a chur i gcrích, comhlíonfaidh Coimisiún an Uachtaráin feidhmeanna agus cumhachtaí an Uachtaráin

source: The Presidential Commission consists of the Chief Justice, the Ceann Comhairle (Chairperson) of the Dáil and the Cathaoirleach (Chairperson) of the Seanad
ga: An Príomh-Bhreitheamh, Ceann Comhairle Dháil Éireann agus Cathaoirleach Sheanad Éireann iad Coimisiún an Uachtaráin

source: If any of those people are unable to act, the President of the High Court, the Leas (Deputy) Ceann Comhairle and the Leas (Deputy) Cathaoirleach, respectively, can act as members instead
ga: Muna bhfuil aon duine acu sin in ann gníomhú is féidir le hUachtarán na hArdchúirte, an Leas Cheann Chomhairle agus an Leas Chathaoirleach, faoi seach, gníomhú mar bhaill ina n-áit

source: Any 2 of the members of the Presidential Commission can perform the functions of the President
ga: Is féidir le haon bheirt de Choimisiún an Uachtaráin feidhmeanna an Uachtaráin a chur i gcrích

source: The Presidential Commission frequently acts instead of the President while they are abroad, for example, by signing Bills into law
ga: Gníomhaíonn an Coimisiún go minic in áit an Uachtaráin nuair atá sé/sí thar lear, mar shampla, le billí a shíniú ina ndlí
